# SQL Assignment

In [2]:
import pandas as pd
import sqlite3

from IPython.display import display, HTML

In [ ]:
# Note that this is not the same db we have used in course videos, please download from this link
# https://drive.google.com/file/d/1O-1-L1DdNxEK6O6nG2jS31MbrMh-OnXM/view?usp=sharing

In [3]:
conn = sqlite3.connect("Db-IMDB-Assignment.db")

#### Overview of all tables

In [3]:
tables = pd.read_sql_query("SELECT NAME AS 'Table_Name' FROM sqlite_master WHERE type='table'",conn)
tables = tables["Table_Name"].values.tolist()

In [4]:
for table in tables:
    query = "PRAGMA TABLE_INFO({})".format(table)
    schema = pd.read_sql_query(query,conn)
    print("Schema of",table)
    display(schema)
    print("-"*100)
    print("\n")

Schema of Movie

   cid       name     type  notnull dflt_value  pk
0    0      index  INTEGER        0       None   0
1    1        MID     TEXT        0       None   0
2    2      title     TEXT        0       None   0
3    3       year     TEXT        0       None   0
4    4     rating     REAL        0       None   0
5    5  num_votes  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Genre

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    GID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Language

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2   LAID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Country

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    CID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Location

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    LID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Location

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    LID     REAL        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Country

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    CID     REAL        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Language

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2   LAID  INTEGER        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Genre

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    GID  INTEGER        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Person

   cid    name     type  notnull dflt_value  pk
0    0   index  INTEGER        0       None   0
1    1     PID     TEXT        0       None   0
2    2    Name     TEXT        0       None   0
3    3  Gender     TEXT        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Producer

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Director

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Cast

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------

## Useful tips:

1. the year column in 'Movie' table, will have few chracters other than numbers which you need to be preprocessed, you need to get a substring of last 4 characters, its better if you convert it as int type, ex: CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER)

2. For almost all the TEXT columns we have show, please try to remove trailing spaces, you need to use TRIM() function

3. When you are doing count(coulmn) it won't consider the "NULL" values, you might need to explore other alternatives like Count(*)

In [5]:
reader =conn.cursor()
reader.execute('update Movie set year=SUBSTR(TRIM(REPLACE(REPLACE(TRIM(year), "(",""),")","")),-4) ')
reader.execute('update Movie set MID=trim(MID) ')
reader.execute('update Person set PID=trim(PID) ')
reader.execute('update Person set Gender=trim(Gender) ')
reader.execute('update M_Director set PID=trim(PID) ')
reader.execute('update M_Director set MID=trim(MID) ')
reader.execute('update M_Producer set PID=trim(PID) ')
reader.execute('update M_Producer set MID=trim(MID) ')
reader.execute('update M_Cast set PID=trim(PID) ')
reader.execute('update M_Cast set MID=trim(MID) ')
reader.execute('update M_Genre set GID=trim(GID) ')
reader.execute('update M_Genre set MID=trim(MID) ')
reader.execute('update Genre set GID=trim(GID) ')
conn.commit()

## Q1 --- List all the directors who directed a 'Comedy' movie in a leap year. (You need to check that the genre is 'Comedy’ and year is a leap year) Your query should return director name, the movie name, and the year.

<h4>To determine whether a year is a leap year, follow these steps:</h4>

<ul>
    <li><b>STEP-1:</b> If the year is evenly divisible by 4, go to step 2. Otherwise, go to step 5.</li>
    <li><b>STEP-2:</b> If the year is evenly divisible by 100, go to step 3. Otherwise, go to step 4.</li>
    <li><b>STEP-3:</b> If the year is evenly divisible by 400, go to step 4. Otherwise, go to step 5.</li>
    <li><b>STEP-4:</b> The year is a leap year (it has 366 days).</li>
    <li><b>STEP-5:</b> The year is not a leap year (it has 365 days).</li>
</ul>

Year 1900 is divisible by 4 and 100 but it is not divisible by 400, so it is not a leap year.

In [12]:
%%time
def grader_1(q1):
    q1_results  = pd.read_sql_query(q1,conn)
    print(q1_results.head(10))
    assert (q1_results.shape == (232,3))

query1 = """ select Name,title,year from Person p join M_Director md on p.PID = md.PID join Movie m on m.MID = md.MID where m.MID in
                            (select MID from Movie where ((year%4=0 and year%100!=0) or (year%4=0 and year%100=0 and year%400=0)) and MID in
                            (select MID from M_Genre where GID in(select GID from Genre where Name LIKE '%comedy%'))) """
grader_1(query1)

                Name                              title  year
0       Milap Zaveri                         Mastizaade  2016
1       Danny Leiner  Harold & Kumar Go to White Castle  2004
2     Anurag Kashyap                 Gangs of Wasseypur  2012
3       Frank Coraci        Around the World in 80 Days  2004
4      Griffin Dunne             The Accidental Husband  2008
5        Anurag Basu                             Barfi!  2012
6    Gurinder Chadha                  Bride & Prejudice  2004
7         Mike Judge    Beavis and Butt-Head Do America  1996
8   Tarun Mansukhani                            Dostana  2008
9       Shakun Batra                      Kapoor & Sons  2016
Wall time: 162 ms

## Q2 --- List the names of all the actors who played in the movie 'Anand' (1971)

In [6]:
%%time
def grader_2(q2):
    q2_results  = pd.read_sql_query(q2,conn)
    print(q2_results.head(10))
    assert (q2_results.shape == (17,1))


query2 = """ select p.Name from Person p join M_Cast mc on p.PID=mc.PID join Movie m on mc.MID=m.MID where m.title='Anand' and m.year=1971 """
grader_2(query2)

                Name
0   Amitabh Bachchan
1      Rajesh Khanna
2     Brahm Bhardwaj
3         Ramesh Deo
4          Seema Deo
5         Dev Kishan
6        Durga Khote
7      Lalita Kumari
8       Lalita Pawar
9       Atam Prakash
Wall time: 458 ms

## Q3 --- List all the actors who acted in a film before 1970 and in a film after 1990. (That is: < 1970 and > 1990.)

In [34]:
%%time

def grader_3a(query_less_1970, query_more_1990):
    q3_a = pd.read_sql_query(query_less_1970,conn)
    print(q3_a.shape)
    q3_b = pd.read_sql_query(query_more_1990,conn)
    print(q3_b.shape)
    return (q3_a.shape == (4942,1)) and (q3_b.shape == (62570,1))

query_less_1970 =""" 
Select p.PID from Person p 
inner join 
(
    select trim(mc.PID) PD, mc.MID from M_cast mc 
where mc.MID 
in 
(
    select mv.MID from Movie mv where CAST(SUBSTR(mv.year,-4) AS Integer)<1970
)
) r1 
on r1.PD=p.PID 
"""
query_more_1990 =""" 
Select p.PID from Person p 
inner join 
(
    select trim(mc.PID) PD, mc.MID from M_cast mc 
where mc.MID 
in 
(
    select mv.MID from Movie mv where CAST(SUBSTR(mv.year,-4) AS Integer)>1990
)
) r1 
on r1.PD=p.PID """
print(grader_3a(query_less_1970, query_more_1990))

# using the above two queries, you can find the answer to the given question

(4942, 1)
(62570, 1)
True
Wall time: 1.29 s

In [7]:
%%time
def grader_3(q3):
    q3_results  = pd.read_sql_query(q3,conn)
    print(q3_results.head(10))
    assert (q3_results.shape == (300,1))

query3 = """ select name from person where pid in
(select p.pid from person p join m_cast mc on p.pid=mc.pid join movie m on mc.mid=m.mid where m.year<1970) and
pid in (select p.pid from person p join m_cast mc on p.pid=mc.pid join movie m on mc.mid=m.mid where m.year>1990) """
grader_3(query3)

                Name
0       Rishi Kapoor
1   Amitabh Bachchan
2             Asrani
3       Zohra Sehgal
4    Parikshat Sahni
5      Rakesh Sharma
6        Sanjay Dutt
7          Ric Young
8              Yusuf
9     Suhasini Mulay
Wall time: 1.19 s

## Q4 --- List all directors who directed 10 movies or more, in descending order of the number of movies they directed. Return the directors' names and the number of movies each of them directed.

In [28]:
%%time

def grader_4a(query_4a):
    query_4a = pd.read_sql_query(query_4a,conn)
    print(query_4a.head(10)) 
    return (query_4a.shape == (1462,2))

query_4a ="""select md.pid, count(*) cnt from m_director md group by md.pid"""
print(grader_4a(query_4a))

# using the above query, you can write the answer to the given question

         PID  cnt
0  nm0000180    1
1  nm0000187    1
2  nm0000229    1
3  nm0000269    1
4  nm0000386    1
5  nm0000487    2
6  nm0000965    1
7  nm0001060    1
8  nm0001162    1
9  nm0001241    1
True
Wall time: 22.9 ms

In [12]:
%%time
def grader_4(q4):
    q4_results  = pd.read_sql_query(q4,conn)
    print(q4_results.head(10))
    assert (q4_results.shape == (58,2))

query4 = """select p.name, count(*) cnt from m_director md join person p on md.pid=p.pid group by p.name having cnt>9 order by cnt desc"""
grader_4(query4)

                    Name  cnt
0           David Dhawan   39
1           Mahesh Bhatt   36
2           Priyadarshan   30
3        Ram Gopal Varma   30
4           Vikram Bhatt   29
5   Hrishikesh Mukherjee   27
6            Yash Chopra   21
7         Shakti Samanta   19
8        Basu Chatterjee   19
9           Subhash Ghai   18
Wall time: 152 ms

## Q5.a --- For each year, count the number of movies in that year that had only female actors.

In [13]:
%%time

# note that you don't need TRIM for person table

def grader_5aa(query_5aa):
    query_5aa = pd.read_sql_query(query_5aa,conn)
    print(query_5aa.head(10)) 
    return (query_5aa.shape == (8846,3))

query_5aa ="""select m.mid, p.gender, count(*) cnt from movie m join m_cast mc on m.mid=mc.mid join person p on mc.pid=p.pid group by m.mid, p.gender"""

print(grader_5aa(query_5aa))

def grader_5ab(query_5ab):
    query_5ab = pd.read_sql_query(query_5ab,conn)
    print(query_5ab.head(10)) 
    return (query_5ab.shape == (3469, 3))

query_5ab ="""select m.mid, p.gender, count(*) from movie m join m_cast mc on m.mid=mc.mid join person p on mc.pid=p.pid where m.mid in (select m.mid from movie m join m_cast mc on m.mid=mc.mid join person p on mc.pid=p.pid where p.gender='Male') group by m.mid"""

print(grader_5ab(query_5ab))


# using the above queries, you can write the answer to the given question

         MID  Gender  cnt
0  tt0021594    None    1
1  tt0021594  Female    3
2  tt0021594    Male    5
3  tt0026274    None    2
4  tt0026274  Female   11
5  tt0026274    Male    9
6  tt0027256    None    2
7  tt0027256  Female    5
8  tt0027256    Male    8
9  tt0028217  Female    3
True
         MID  Gender  count(*)
0  tt0021594    Male         9
1  tt0026274    Male        22
2  tt0027256    Male        15
3  tt0028217  Female        10
4  tt0031580  Female        44
5  tt0033616    Male        54
6  tt0036077    Male        14
7  tt0038491    Male        12
8  tt0039654    Male        13
9  tt0040067  Female        21
True
Wall time: 2.39 s

In [37]:
%%time
def grader_5a(q5a):
    q5a_results  = pd.read_sql_query(q5a,conn)
    print(q5a_results.head(10))
    assert (q5a_results.shape == (4,2))

query5a = """select m.year, count(*) from movie m where not exists (select * from Person p, m_Cast mc where p.pid = mc.PID and mc.mid = m.mid and p.gender!='Female') group by m.year"""
grader_5a(query5a)

   year  count(*)
0  1939         1
1  1999         1
2  2000         1
3  2018         1
Wall time: 50.1 s

## Q5.b --- Now include a small change: report for each year the percentage of movies in that year with only female actors, and the total number of movies made that year. For example, one answer will be: 1990 31.81 13522 meaning that in 1990 there were 13,522 movies, and 31.81% had only female actors. You do not need to round your answer.

In [13]:
%%time
def grader_5b(q5b):
    q5b_results  = pd.read_sql_query(q5b,conn)
    print(q5b_results.head(10))
    assert (q5b_results.shape == (4,3))

query5b = """select x.year,((x.Movies_Cnt*100.0)/y.allMov) as Percent , y.allMov as 'tot_mov' from (select m.year,count(*) Movies_Cnt from Movie m where m.MID not in (select mc.MID from M_Cast mc inner join  Person p on p.PID = mc.PID where p.Gender = 'Male') group by m.year) x inner join (select m.year as Year, Count(*) allMov from Movie as m group by m.year) y on x.year = y.year"""
grader_5b(query5b)

   year    Percent  tot_mov
0  1939  50.000000        2
1  1999   1.515152       66
2  2000   1.562500       64
3  2018   0.961538      104
Wall time: 1.3 s

## Q6 --- Find the film(s) with the largest cast. Return the movie title and the size of the cast. By "cast size" we mean the number of distinct actors that played in that movie: if an actor played multiple roles, or if it simply occurs multiple times in casts, we still count her/him only once.

In [14]:
%%time
def grader_6(q6):
    q6_results  = pd.read_sql_query(q6,conn)
    print(q6_results.head(10))
    assert (q6_results.shape == (3473, 2))

query6 = """select m.title, c.tcount count from movie m join (select  count(distinct mc.pid) tcount, mc.mid mid from m_cast mc group by mc.mid) c on m.mid=c.mid order by count"""
grader_6(query6)

                                             title  count
0                                Return of Hanuman      1
1  Chaar Sahibzaade 2: Rise of Banda Singh Bahadur      1
2                            Vaibhav Sethia: Don't      1
3                                      Subah Subah      1
4                                       Kala Jigar      1
5                                             Pihu      2
6                              Mumbai Delhi Mumbai      2
7                                 Chaar Sahibzaade      2
8                               Leera the Soulmate      2
9                        Motu Patlu: King of Kings      2
Wall time: 215 ms

### Q7 --- A decade is a sequence of 10 consecutive years. 
### For example, say in your database you have movie information starting from 1931. 
### the first decade is 1931, 1932, ..., 1940,
### the second decade is 1932, 1933, ..., 1941 and so on. 
### Find the decade D with the largest number of films and the total number of films in D

In [39]:
%%time
def grader_7a(q7a):
    q7a_results  = pd.read_sql_query(q7a,conn)
    print(q7a_results.head(10))
    assert (q7a_results.shape == (78, 2))

query7a = """select m.year, count(*) from movie m group by m.year"""
grader_7a(query7a)

# using the above query, you can write the answer to the given question

   year  count(*)
0  1931         1
1  1936         3
2  1939         2
3  1941         1
4  1943         1
5  1946         2
6  1947         2
7  1948         3
8  1949         3
9  1950         2
Wall time: 73.8 ms

In [45]:
%%time
def grader_7b(q7b):
    q7b_results  = pd.read_sql_query(q7b,conn)
    print(q7b_results.head(10))
    assert (q7b_results.shape == (713, 4))

query7b = """   
    with table1 as (select m.year, count(*) from movie m group by m.year) select * from table1 t1 join table1 t2 where t2.year<=(t1.year+9) and t2.year>=t1.year
          """
grader_7b(query7b)
# if you see the below results the first movie year is less than 2nd movie year and 
# 2nd movie year is less or equal to the first movie year+9

# using the above query, you can write the answer to the given question

   year  count(*)  year  count(*)
0  1931         1  1931         1
1  1931         1  1936         3
2  1931         1  1939         2
3  1936         3  1936         3
4  1936         3  1939         2
5  1936         3  1941         1
6  1936         3  1943         1
7  1939         2  1939         2
8  1939         2  1941         1
9  1939         2  1943         1
Wall time: 102 ms

In [37]:
%%time
def grader_7(q7):
    q7_results  = pd.read_sql_query(q7,conn)
    print(q7_results.head(10))
    assert (q7_results.shape == (1, 2))

query7 = """select y.year as decade_start, count(*) as num_movies from (select distinct year from movie) y join movie m on m.year >= y.year and m.year < y.year + 10 group by y.year order by count(*) desc limit 1"""
grader_7(query7)
# if you check the output we are printinng all the year in that decade, its fine you can print 2008 or 2008-2017

  decade_start  num_movies
0         2008        1203
Wall time: 192 ms

## Q8 --- Find all the actors that made more movies with Yash Chopra than any other director.

In [57]:
%%time
def grader_8a(q8a):
    q8a_results  = pd.read_sql_query(q8a,conn)
    print(q8a_results.head(10))
    assert (q8a_results.shape == (73408, 3))

query8a = """select distinct mc.pid actor, md.pid director, count(*) movies from m_cast mc join m_director md on mc.mid=md.mid group by actor, director"""
grader_8a(query8a)

# using the above query, you can write the answer to the given question

       actor   director  movies
0  nm0000002  nm0496746       1
1  nm0000027  nm0000180       1
2  nm0000039  nm0896533       1
3  nm0000042  nm0896533       1
4  nm0000047  nm0004292       1
5  nm0000073  nm0485943       1
6  nm0000076  nm0000229       1
7  nm0000092  nm0178997       1
8  nm0000093  nm0000269       1
9  nm0000096  nm0113819       1
Wall time: 956 ms

In [6]:
%%time

def grader_8(q8):
    q8_results  = pd.read_sql_query(q8,conn)
    print(q8_results.head(10))
    print(q8_results.shape)
    assert (q8_results.shape == (245, 2))

query8 = """with t1 as (select actor,movies from 
    
( select mc.pid as actor,md.pid as director,p.pid,count(*) as movies,rank() over (partition by mc.pid order by count(*) desc) as rn,p.name from m_director as md join m_cast as mc on md.mid=mc.mid left join person as p on md.pid=p.pid and name = 'Yash Chopra' group by mc.pid,md.pid)where rn =1 and director like 'nm0007181') select p.name, t.movies from person p join t1 t on p.pid=t.actor"""
grader_8(query8)

                Name  movies
0      Sharib Hashmi       1
1    Kulbir Badesron       1
2        Gurdas Maan       1
3    Parikshat Sahni       3
4      Claire Ashton       1
5     Waheeda Rehman       5
6           Taj Gill       1
7         Kumud Pant       1
8   Gerald Tomkinson       1
9   Dev K. Kantawall       1
(245, 2)
Wall time: 1.68 s

## Q9 --- The Shahrukh number of an actor is the length of the shortest path between the actor and Shahrukh Khan in the "co-acting" graph. That is, Shahrukh Khan has Shahrukh number 0; all actors who acted in the same film as Shahrukh have Shahrukh number 1; all actors who acted in the same film as some actor with Shahrukh number 1 have Shahrukh number 2, etc. Return all actors whose Shahrukh number is 2.

In [7]:
%%time
def grader_9a(q9a):
    q9a_results  = pd.read_sql_query(q9a,conn)
    print(q9a_results.head(10))
    print(q9a_results.shape)
    assert (q9a_results.shape == (2382, 1))

query9a = """with t1 as (select mid from  m_cast mc where mc.pid='nm0451321'), t2 as (select distinct p.pid from m_cast mc where mc.mid in t1 and mc.pid!='nm0451321'), t3 as (select distinct mc.mid from m_cast mc where mc.pid in t2 and mc.mid not in t1) select distinct pid from m_cast mc where mc.mid in t1 and pid!='nm0451321'"""
grader_9a(query9a)
# using the above query, you can write the answer to the given question

# selecting actors who acted with srk (S1)
# selecting all movies where S1 actors acted, this forms S2 movies list
# selecting all actors who acted in S2 movies, this gives us S2 actors along with S1 actors
# removing S1 actors from the combined list of S1 & S2 actors, so that we get only S2 actors

         PID
0  nm0004418
1  nm1995953
2  nm2778261
3  nm0631373
4  nm0241935
5  nm0792116
6  nm1300111
7  nm0196375
8  nm1464837
9  nm2868019
(2382, 1)
Wall time: 166 ms

In [19]:
%%time
def grader_9(q9):
    q9_results  = pd.read_sql_query(q9,conn)
    print(q9_results.head(10))
    print(q9_results.shape)
    assert (q9_results.shape == (25698, 1))

query9 = """with t1 as (select mid from  m_cast mc where mc.pid='nm0451321'), t2 as (select distinct mc.pid from m_cast mc where mc.mid in t1 and mc.pid!='nm0451321'), t3 as (select distinct mc.mid from m_cast mc where mc.pid in t2), t4 as (select pid from m_cast where mid in t3 and pid not in t2) select name from person p where p.pid in t4 and p.pid!='nm0451321'"""
grader_9(query9)

                     Name
0            Freida Pinto
1             Rohan Chand
2            Damian Young
3         Waris Ahluwalia
4   Caroline Christl Long
5           Rajeev Pahuja
6       Michelle Santiago
7         Alicia Vikander
8            Dominic West
9          Walton Goggins
(25698, 1)
Wall time: 893 ms